Revit 2026 API

# SweptBlendBottomProfileSymbol Property

---

The bottom family symbol profile of the swept blend.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilySymbolProfile BottomProfileSymbol { get; }
```
```vb
Public ReadOnly Property BottomProfileSymbol As FamilySymbolProfile
	Get
```
```cpp
public:
property FamilySymbolProfile^ BottomProfileSymbol {
	FamilySymbolProfile^ get ();
}
```
```fsharp
member BottomProfileSymbol : FamilySymbolProfile with get
```

#### Property Value

FamilySymbolProfile

If the bottom profile is sketch-based, this property is .

#### Reference

SweptBlend Class

Autodesk.Revit.DB Namespace